import react from 'react'

function Home() {

  return (
    <>
      <h1> Hello สวัสดีครับทุกคน</h1>
      <p>รวบ"หนุ่มสถาปัตย์"ลอบเพาะ "เห็ดขี้ควาย" ขายทางออนไลน์รายได้หลักแสนบาทตามนโยบายสำนักงานตำรวจแห่งชาติ และกองบัญชาการตำรวจนครบาล กำหนดให้มีการจับกุมผู้กระทำความผิดเกี่ยวกับยาเสพติด ซึ่งสร้างความเสียหายต่อประชาชนและความมั่นคงของประเทศโดยเมื่อวันที่ 26 มีนาคม 2567 เวลาประมาณ 13.42 น. เจ้าหน้าที่สืบนครบาล จับกุมตัว นายเตชิต อายุ 24 ปี ซึ่งเป็นผู้ต้องหาตามหมายจับศาลอาญา ที่ 120/2567 ลงวันที่ 26 มีนาคม 2567 ซึ่งต้องหากระทำความผิดฐาน “มียาเสพติดให้โทษประเภท 5 (เห็ดขี้ควาย) ไว้ในครอบครอง โดยผิดกฎหมาย” และ “จำหน่ายเสพติดให้โทษประเภท 5 (เห็ดขี้ควาย) โดยผิดกฎหมาย” โดยก่อนออกหมายจับได้ดำเนินการสืบสวนและส่งมอบพยานหลักฐานให้แก่พนักงานสอบสวน สน.พญาไท เพื่อดำเนินการออกหมายจับผู้ต้องหา</p>
    </>
  )
}

export default Home
